/* Cancel按钮 */
"kAlertBtnCancel" = "Cancel";

/* 关闭按钮 */
"kAlertBtnClose" = "Close";

/* OK按钮 */
"kAlertBtnOK" = "OK";

/* Retry按钮 */
"kAlertBtnRetry" = "Retry";

/* Settings按钮 */
"kAlertBtnSettings" = "Settings";

/* 升级按钮 */
"kAlertBtnUpgrade" = "Upgrade";

/* 查看按钮 */
"kAlertBtnView" = "View";

/* xx即将到达，xx is coming. */
//"kAlertFrmStringArrived" = "%@ is coming.";
"kAlertFrmStringArrived" = "%@";

/* xx已经离开，Leave xx */
"kAlertFrmStringLeaved" = "%@";

/* 需要打开internet连接访问地图的提示框的内容 */
"kAlertNeedInternetBodyAccessMaps" = "You must connect to a Wi-Fi or cellular data network to access maps data.";

/* 需要打开internet连接访问地图的提示框的标题 */
"kAlertNeedInternetTitleAccessMaps" = "Cannot Get Maps Data";

/* 需要打开internet连接访问App store的提示框的内容 */
"kAlertNeedInternetBodyAccessAppStore" = "You must connect to a Wi-Fi or cellular data network to access the App Store.";

/* 需要打开internet连接访问App store的提示框的标题 */
"kAlertNeedInternetTitleAccessAppStore" = "Cannot Connect to the App Store";

/* 打开定位服务的提示框的消息内容 */
"kAlertNeedLocationServicesBody" = "You must turn on “Location Services” to allow the application to determine your location.";

/* 打开定位服务的提示框的消息标题 */
"kAlertNeedLocationServicesTitle" = "Cannot Get Current Location";

/* 升级为pro版本的提示框的消息内容 */
"kAlertUpgradeProVesionBody" = "You must upgrade the application to full version to increase more iAlarm.";

/* 升级为pro版本的提示框的消息标题 */
"kAlertUpgradeProVesionTitle" = "Upgrade to Full Version";


/* 查询失败的提示框内容：请重试。Please try again.（错误的默认提示） */
"kAlertSearchBodyTryAgain" = "Please try again.";

/* 查询失败的提示框内容：Please try tomorrow.对应“一天内查询次数过多” */
"kAlertSearchBodyTryTomorrow" = "Please try tomorrow.";

/* 查询提示框标题，Search */
"kAlertSearchTitle" = "Search";

/* 地址查询失败的提示框标题：发生网络错误，Network Error，（错误的默认提示） */
"kAlertSearchTitleDefaultError" = "Network Error";

/* 地址查询失败的提示框标题：无结果，No Results Found */
"kAlertSearchTitleNoResults" = "No Results Found";

/* 查询完成，有多个结果提示用户选择，Did you mean... */
"kAlertSearchTitleResults" = "Did you mean...";

/* 地址查询失败的提示框标题：一天内查询次数过多，Too Many Queries have been Made */
"kAlertSearchTitleTooManyQueries" = "Too Many Queries have been Made";

/* 购买的消息标题 */
"kAlertPurchaseTitle" = "Purchase";
/* 需要打开允许购买选项的消息标题 */
"kAlertPurchasenNotAllowPurchaseBody" = "You do not have In-App Purchases enabled.";

/* 东经格式化串 */
"kCoordinateFrmStringEastLongitude" = "%d°%d′%d″E";

/* 东经格式化串(值与符号间有空格) */
"kCoordinateFrmStringEastLongitudeSpace" = "%d°%d′%d″ E";

/* 东经格式化串(秒上带小数) */
"kCoordinateFrmStringEastLongitudeDecimal" = "%d°%d′%d.%d″ E";


/* 北纬格式化串 */
"kCoordinateFrmStringNorthLatitude" = "%d°%d′%d″N";

/* 北纬格式化串(值与符号间有空格) */
"kCoordinateFrmStringNorthLatitudeSpace" = "%d°%d′%d″ N";

/* 北纬格式化串(秒上带小数) */
"kCoordinateFrmStringNorthLatitudeDecimal" = "%d°%d′%d.%d″ N";


/* 南纬格式化串 */
"kCoordinateFrmStringSouthLatitude" = "%d°%d′%d″S";

/* 南纬格式化串(值与符号间有空格) */
"kCoordinateFrmStringSouthLatitudeSpace" = "%d°%d′%d″ S";

/* 南纬格式化串(秒上带小数) */
"kCoordinateFrmStringSouthLatitudeDecimal" = "%d°%d′%d.%d″ S";


/* 西经格式化串 */
"kCoordinateFrmStringWestLongitude" = "%d°%d′%d″W";

/* 西经格式化串(值与符号间有空格) */
"kCoordinateFrmStringWestLongitudeSpace" = "%d°%d′%d″ W";

/* 西经格式化串(秒上带小数) */
"kCoordinateFrmStringWestLongitudeDecimal" = "%d°%d′%d.%d″ W";


/* 默认的位置闹钟名称 */
"KDefaultAlarmName" = "iAlarm";

/* 警示半径类型名称-001，Near */
"KDicAlarmRadius001" = "Near";

/* 警示半径类型名称-002，Standard */
"KDicAlarmRadius002" = "Standard";

/* 警示半径类型名称-003，Far */
"KDicAlarmRadius003" = "Far";

/* 警示半径类型名称-004，Custom */
"KDicAlarmRadius004" = "Custom";

/* 混合地图类型名称 */
"KDicMapTypeNameHybrid" = "Hybrid";

/* 卫星地图类型名称 */
"KDicMapTypeNameSatellite" = "Satellite";

/* 标准地图类型名称 */
"KDicMapTypeNameStandard" = "Map";

/* 开关值已经关闭 */
"KDicOff" = "Off";

/* 开关值已经打开 */
"KDicOn" = "On";

/* 重复类型的名称-001，Once */
"KDicRepeateTypeName001" = "Once";

/* 重复类型的名称-002，Forever*/
"KDicRepeateTypeName002" = "Always";

/* 闹钟铃声名称-无 */
"KDicSoundName000" = "None";

/* 闹钟铃声名称-001 */
"KDicSoundName001" = "Marimba";

/* 闹钟铃声名称-002 */
"KDicSoundName002" = "Xylophone";

/* 闹钟铃声名称-003 */
"KDicSoundName003" = "Harp";

/* 闹钟铃声名称-004 */
"KDicSoundName004" = "Old Phone";

/* 闹钟铃声名称-005 */
"KDicSoundName005" = "Trill";

/* 闹钟铃声名称-006 */
"KDicSoundName006" = "KDicSoundName006";

/* 闹钟铃声名称-007 */
"KDicSoundName007" = "KDicSoundName007";

/* 闹钟铃声名称-008 */
"KDicSoundName008" = "KDicSoundName008";

/* 闹钟铃声名称-009 */
"KDicSoundName009" = "KDicSoundName009";

/* 闹钟铃声名称-010 */
"KDicSoundName010" = "KDicSoundName010";

/* 闹钟铃声名称-011 */
"KDicSoundName011" = "KDicSoundName011";

/* 闹钟铃声名称-012 */
"KDicSoundName012" = "KDicSoundName012";

/* 闹钟铃声名称-013 */
"KDicSoundName013" = "KDicSoundName013";

/* 闹钟铃声名称-014 */
"KDicSoundName014" = "KDicSoundName014";

/* 闹钟铃声名称-015 */
"KDicSoundName015" = "KDicSoundName015";

/* 闹钟铃声名称-016 */
"KDicSoundName016" = "KDicSoundName016";

/* 触发条件类型的名称，When I Arrive */
"kDicTriggerTypeNameWhenArrive" = "When I Arrive";       

/* 触发条件类型的名称，When I Leave */
"kDicTriggerTypeNameWhenLeave" = "When I Leave";

/* Alarm是否启用的标签 */
"KLabelAlarmEnable" = "Enabled";

/* 信息卡视图地址的标签（英文小写） */
"KLabelAlarmMapInfo" = "address";

/* 闹钟名字的标签 */
"KLabelAlarmName" = "Label";

/* 地址的标签 */
"KLabelAlarmPostion" = "Destination";

/* 警示半径的标签 */
"KLabelAlarmRadius" = "Alarm Radius";

/* 重复类型的标签 */
"KLabelAlarmRepeat" = "Repeat";

/* 声音的标签 */
"KLabelAlarmSound" = "Sound";

/* 振动的标签 */
"KLabelAlarmVibrate" = "Vibrate";

/* 触发警告条件的标签 */
"KLabelAlarmTrigger" = "Alarm";

/* 地图书签视图的提示文本 */
"KLabelMapBookmarksView" = "Choose a iAlarm to view on the map";

/* 新增闹钟的大头针的标题 */
"KLabelMapNewAnnotationTitle" = "Drag to Change Destination";

/* 关于tab的标题 */
"KTabTitleAbout" = "About";

/* 闹钟列表tab标题 */
"KTabTitleAlarmList" = "iAlarm List";

/* 闹钟地图tab标题 */
"KTabTitleAlarmMaps" = "iAlarm Maps";

/* 设置tab的标题 */
"KTabTitleSetting" = "Setting";

/* 提示无法反转地址，需要打开internet连接的提示文本 */
"KTextPromptNeedInternetToReversing" = "You must connect to a Wi-Fi or cellular data network to reverse the geographical coordinate to address information.";

/* 提示无法取得当前位置，需要通过地图指定位置的提示文本 */
"KTextPromptNeedSetLocationByMaps" = "Cannot determine current location. Please set the destination using the map";

/* 空闹钟列表的背景文字 */
"KTextPromptNoiAlarms" = "No iAlarms";

/* 正在定位的提示文本 */
"KTextPromptWhenLocating" = "Current Location...";

/* 正在反转地址的提示文本 */
"KTextPromptWhenReversing" = "Reversing Coordinate...";

/* 正在载入的提示文本 */
"KTextPromptWhenLoading" = "Loading Maps...";

/* 当前位置的文本 */
"KTextPromptDistanceCurrentLocation" = "%.1f km away";//"Distance to Current Location:%.1fkm";

/* 当前位置的文本 */
"KTextPromptCurrentLocation" = "Current Location";

/* 这是当前位置的文本 */
"KTextPromptItIsCurrentLocation" = "This is Current Location.";

/* 搜索bar的Placeholder */
"KTextPromptPlaceholderOfSearchBar" = "Search or Destination";


/* 千米(单数) */
"kUnitKilometre" = "km";

/* 米(单数) */
"kUnitMeter" = "m";

/* 米(复数) */
"kUnitMeters" = "m";

/* 添加闹钟视图标题 */
"KViewTitleAddAlarms" = "Add iAlarm";

/* 编辑地址的视图标题 */
"KViewTitleAlarmPostion" = "Destination";

/* 编辑警示半径视图标题 */
"KViewTitleAlarmRadius" = "Alarm Radius";

/* 闹钟列表视图标题 */
"KViewTitleAlarmsList" = "iAlarm List";

/* 闹钟地图视图标题 */
"KViewTitleAlarmsListMaps" = "iAlarm Maps";

/* 编辑闹钟视图标题 */
"KViewTitleEditAlarms" = "Edit iAlarm";

/* 信息卡视图标题 */
"KViewTitleInformation" = "Info";

/* 地图书签视图的标题 */
"KViewTitleMapBookmarks" = "iAlarms";

/* 编辑名称视图标题 */
"KViewTitleName" = "Label";

/* 编辑重复类型视图标题 */
"KViewTitleRepeat" = "Repeat";

/* 编辑铃声视图标题 */
"KViewTitleSound" = "Sound";

/* 编辑振动视图标题 */
"KViewTitleVibrate" = "Vibrate";

/* 触发警告条件视图的标题 */
"KViewTitleTrigger" = "Alarm";





////////////////////////////////////////////////////////
/* app store 的链接 */
"KLinkAppStoreLite" = "http://itunes.apple.com/us/app/ialarm-location-alarm/id427929181?mt=8";
"KLinkAppStoreFullVersion" = "http://itunes.apple.com/us/app/ialarm-pro/id468639288?ls=1&mt=8";

"KLinkCustomAppStoreLite" = "http://bit.ly/iAlarmLite_us";
"KLinkCustomAppStoreFullVersion" = "http://bit.ly/iAlarm_Us";


/* Facebook cell的标签 */
"KLabelCellFacebook" = "Facebook";

/* Facebook:send to 的标签 */
"KLabelCellFBSendTo" = "To:";

/* 短信 cell的标签 */
"KLabelCellMessages" = "Messages";

/* 评分cell的标签 */
"KLabelCellRateAndReview" = "Write a Review";

/* Twitter cell的标签 */
"KLabelCellTwitter" = "Twitter";

/* 邮件 cell的标签 */
"KLabelCellEmail" = "Mail";

/* 版本cell的标签 */
"KLabelCellVersion" = "Version";

/* 购买完全版cell的标签 */
"KLabelCellBuyFullVersion" = "DownLoad FullVersion";

/* 朋友们的Facebook涂鸦墙Section头的标签 */
"KLabelSectionFBFriendsWall" = "Friend's Wall";

/* 我的Facebook涂鸦墙Section头的标签 */
"KLabelSectionFBMyWell" = "My Wall";

/* 版本Section的脚 */
"KLabelSectionFooterVersion" = "Powered by L&T";//"Copyright © 2010-2011, L&T, All Rights Reserved.";

/* 评分Section头的标签 */
"KLabelSectionHeaderRateAndReview" = "Rate/review in App Store";

/* 分享Section的标签 */
"KLabelSectionHeaderShare" = "Share";

/* 版本Section头的标签 */
"KLabelSectionHeaderVersion" = "iAlarm";


/* 退出fb提示的文本,Login As XX (不是你？) */
"KTextPromptFBLoginAsXX" = "Logged in as %@ (Not You?)";

/* 还有xx个fb联系人的文本,还有 %d 个... */
"KTextPromptFBMore" = " & %d more...";

/* 选择联系人视图的提示 */
"KViewPromptCheckContacts" = "Choose walls to Post";

/* 关于视图标题 */
"KViewTitleAbout" = "About";

/* FB new feed视图标题 */
"KViewTitleFBNewFeed" = "Write Post";

/* TW new Tweet视图标题 */
"KViewTitleTWNewTweet" = "New Tweet";

/* FB 所有朋友视图标题，所有的朋友 */
"KViewTitleAllFBFriends" = "All Friends";


/* 提示退出facebook登录状态的提示框的标题 */
"kAlertBeforeLogoutFBInternetTitle" = "Logout from Facebook ?";


/* 文本,Sending... */
"KTextPromptSending" = "Sending...";

/* 文本,xx 位朋友*/
"KTextPromptXXFriends" = "%d Friends";

/* 文本,下xx位朋友*/
"KTextPromptNextXXFriends" = "%d More...";


/* Share按钮 */
"kBtnShare" = "Share";

/* Send按钮 */
"kBtnSend" = "Send";

/* Cancel按钮 */
"kBtnCancel" = "Cancel";

/* 需要打开internet连接访问Facebook的提示框的内容 */
"kAlertNeedInternetBodyAccessFacebook" = "You must connect to a Wi-Fi or cellular data network to access Facebook.";

/* 需要打开internet连接访问Twitter的提示框的内容 */
"kAlertNeedInternetBodyAccessTwitter" = "You must connect to a Wi-Fi or cellular data network to access Twitter.";

/* 需要打开internet连接访问facebook的提示框的标题 */
"kAlertNeedInternetTitleAccessFacebook" = "Cannot Connect to Facebook";

/* 需要打开internet连接访问Twitter的提示框的标题 */
"kAlertNeedInternetTitleAccessTwitter" = "Cannot Connect to Twitter";


/* 要求评分的提示框的标题 */
"kAlertConfirmRateTitle" = "Enjoying iAlarm?";

/* 要求评分的提示框的内容 */
"kAlertConfirmRateBody" = "If so,please rate this App with 5 stars on the App Store so we can keep the free updates coming.";

/* 要求评分的提示框的 ‘去评分’按钮  */
"kAlertConfirmRateBtnToRate" = "Yes,rate it!";

/* 要求评分的提示框的 ‘No,Thanks’按钮 */
"kAlertConfirmRateBtnNoThanks" = "Remind me later";

/* 要求评分的提示框的 ‘Not to remind’按钮 */
"kAlertConfirmRateBtnNotToremind" = "Don't ask again!";


/* 共享内容Get the app */
"KShareContentTextGetTheApp" = "Download the App";

/* 共享内容Get the app */
"KShareContentTwitterMessage" = "Here is a very useful iPhone App - \"iAlarm\"！";

/* 共享内容Get the app */
"KShareContentMailMessage" = "Hey buddy,have you ever missed your stop because of playing games,refreshing your twitter or falling asleep on bus? It doesn't matter,try this iPhone App - \"iAlarm\". Its professional unique positioning remind function may be just what you need.";

/* 共享内容Get the app */
"KShareContentMailTitle" = "Here is a very useful iPhone App - \"iAlarm\"！";
